app/Controllers/Attachment.php

INSERT INTO `attachment` (`id_tugas`, `type`, `file`, `description`) VALUES ('3', 'photo', '1745489221_ba1d4ec99c3253acab26.jpg', '')
---
    public function store()
    {
        if ($this->request->getMethod() === 'post') {
            // Mengambil file dari form input
            $file = $this->request->getFile('foto');

            // Pastikan file valid
            if ($file->isValid() && !$file->hasMoved()) {
                // Tentukan folder tujuan penyimpanan file
                $filePath = 'uploads/attachment/';
                $fileName = $file->getRandomName(); // Nama file acak

                // Pindahkan file ke folder tujuan
                $file->move($filePath, $fileName);

                // Menyimpan data lampiran ke database
                $data = [
                    'id_tugas' => $this->request->getPost('idtugas'),
                    'file' => $fileName,
                    'tipe' => $this->request->getPost('tipe'),
                    'desk' => $this->request->getPost('desk')
                ];

                // Insert data ke database
                $this->attachmentModel->insert($data);