app/Controllers/Groups.php

    public function index()
    {
        $userId = session()->get('id_user');

        // Grup yang dibuat oleh user
        $createdGroups = $this->GroupModel
        ->where('groups.id_user', $userId) // <<< perjelas nama tabel
        ->join('user', 'user.id_user = groups.id_user')
        ->select('groups.*, user.username')
        ->findAll();
---
SELECT `groups`.*, `user`.`username`
FROM `groups`
JOIN `user` ON `user`.`id_user` = `groups`.`id_user`
WHERE `groups`.`id_user` = '2'

    public function store()
    {
        // Ambil ID user dari session, tidak perlu diambil dari form
        $createdBy = session()->get('id_user');

        // Menyimpan data grup
        $this->GroupModel->save([
            'group_name' => $this->request->getPost('group_name'),
            'id_user' => $createdBy, // Set id_user dengan ID user dari session
            'photo' => $this->uploadphoto(),
            'password' => password_hash($this->request->getPost('password'), PASSWORD_DEFAULT),
            'description' => $this->request->getPost('description')
        ]);
---
INSERT INTO `groups` (`group_name`, `id_user`, `photo`, `password`, `description`) VALUES ('bakteri', '2', '1745307811_20bff453f03758548bae.jpg', '$2y$10$7yf6OF5Oyg3XXHLEzRwzi.rYS9gFp1V7dvfDeqTVDEB7yOmfpWWRm', 'apapapap')

    public function detail($id)
    {
        $group = $this->GroupModel->find($id);
        $members = $this->GroupModel->getMembers($id); // Misal ada method untuk ambil anggota grup
        $isOwner = $group['id_user'] == session()->get('id_user');  // Cek apakah yang melihat adalah pembuat grup

        $users = $this->UserModel->where('id_user !=', session()->get('id_user'))->findAll();
---
SELECT *
FROM `user`
WHERE `id_user` != '2'

    public function addMember()
    {
        $data = [
            'id_groups' => $this->request->getPost('id_groups'),
            'user_id' => $this->request->getPost('user_id'),
            'member_level' => 'anggota',  // Default level anggota, bisa sesuaikan jika admin
        ];

        $memberModel = new MemberModel();
        $memberModel->save($data);
---
INSERT INTO `member` (`id_groups`, `user_id`, `member_level`) VALUES ('8', '3', 'anggota')