app/Controllers/Home.php

    public function index()
    {
        $sharedModel = new \App\Models\SharedModel();
        $tugasModel = new \App\Models\TugasModel();

        $userId = session()->get('id');

        // Ambil semua tugas yang dibagikan ke user ini dan belum selesai
        $sharedTugas = $sharedModel
            ->join('tugas', 'shared.id_tugas = tugas.id')
            ->where('shared.shared_to', $userId)
            ->whereNotIn('tugas.status', ['Selesai', 'Batal'])
            ->select('tugas.*, shared.accepted')
            ->findAll();
---
SELECT `tugas`.*, `shared`.`accepted`
FROM `shared`
JOIN `tugas` ON `shared`.`id_tugas` = `tugas`.`id`
WHERE `shared`.`shared_to` IS NULL
AND `tugas`.`status` NOT IN ('Selesai','Batal')