app/Controllers/Home.php

SELECT COUNT(*) AS `numrows`
FROM `tugas`
WHERE `creator_id` = '2'
AND `status` = 'to do'
SELECT COUNT(*) AS `numrows`
FROM `tugas`
WHERE `creator_id` = '2'
AND `status` = 'doing'
SELECT COUNT(*) AS `numrows`
FROM `tugas`
WHERE `creator_id` = '2'
AND `status` = 'selesai'
SELECT COUNT(*) AS `numrows`
FROM `tugas`
WHERE `creator_id` = '2'
AND `status` = 'batal'
SELECT *
FROM `tugas`
WHERE `creator_id` = '2'
AND `status` != 'selesai'
AND CONCAT(date_due, ' ', time_due) BETWEEN '2025-04-23 07:51:20' AND '2025-04-24 07:51:20'
SELECT *
FROM `tugas`
WHERE `creator_id` = '2'
AND `date_due` = '2025-04-23'
SELECT `groups`.*
FROM `member`
JOIN `groups` ON `groups`.`id_groups` = `member`.`id_groups`
WHERE `member`.`user_id` = '2'
---
    public function index()
    {
        $userId = session()->get('id_user');

        // Statistik jumlah tugas
        $data['totalToDo'] = $this->tugasModel->where('creator_id', $userId)->where('status', 'to do')->countAllResults();
        $data['totalDoing'] = $this->tugasModel->where('creator_id', $userId)->where('status', 'doing')->countAllResults();
        $data['totalSelesai'] = $this->tugasModel->where('creator_id', $userId)->where('status', 'selesai')->countAllResults();
        $data['totalBatal'] = $this->tugasModel->where('creator_id', $userId)->where('status', 'batal')->countAllResults();

        // Tugas mendekati deadline (misal < 24 jam)
        $now = date('Y-m-d H:i:s');
        $besok = date('Y-m-d H:i:s', strtotime('+1 day'));

        $data['tugasMendekatiDeadline'] = $this->tugasModel
            ->where('creator_id', $userId)
            ->where('status !=', 'selesai')
            ->where("CONCAT(date_due, ' ', time_due) BETWEEN '$now' AND '$besok'")
            ->findAll();

        // Tugas hari ini
        $today = date('Y-m-d');
        $data['tugasHariIni'] = $this->tugasModel
            ->where('creator_id', $userId)
            ->where('date_due', $today)
            ->findAll();

        // Grup yang user ikuti
        $data['groups'] = $this->memberModel
            ->join('groups', 'groups.id_groups = member.id_groups')
            ->where('member.user_id', $userId)
            ->select('groups.*')
            ->findAll();