app/Controllers/Tugas.php

SELECT *
FROM `tugas`
WHERE `tugas`.`id` = '7'
---
    public function edit($id)
    {
        $data['title'] = 'Edit tugas';
        $data['tugas'] = $this->tugasModel->find($id);

UPDATE `tugas` SET `tugas` = 'belajar', `tanggal` = '2025-04-15', `waktu` = '09:09:00', `status` = 'To do'
WHERE `tugas`.`id` IN ('7')
---
    public function update($id)
{
    $dataTugas = [
        'tugas'    => $this->request->getPost('tugas'),
        'tanggal'  => $this->request->getPost('tanggal'),
        'status'   => $this->request->getPost('status'),
        'alarm'    => $this->request->getPost('alarm'),
        'date_due' => $this->request->getPost('date_due'),
        'time_due' => $this->request->getPost('time_due'),
        'time_finished' => $this->request->getPost('status') === 'selesai' ? date('Y-m-d H:i:s') : null,
        'date_finished' => $this->request->getPost('date_finished'),
    ];

    $this->tugasModel->update($id, $dataTugas);

SELECT *
FROM `tugas`
WHERE `tugas`.`id` = '15'
SELECT *
FROM `attachment`
WHERE `id_tugas` = '15'
SELECT *
FROM `user`
SELECT *
FROM `groups`
SELECT *
FROM `shared`
JOIN `user` ON `user`.`id_user` = `shared`.`id_user`
WHERE `shared`.`id_tugas` = '15'
---
    public function detail($id)
    {
        $attachmentModel = new AttachmentModel();
        $userModel = new UserModel();
        $groupsModel = new GroupsModel();
        $sharedModel = new SharedModel();

        // Ambil data tugas
        $tugas = $this->tugasModel->find($id);

        if (!$tugas) {
            return redirect()->to('/tugas')->with('error', 'Tugas tidak ditemukan.');
        }

        // Mengambil lampiran tugas
        $attachments = $attachmentModel->where('id_tugas', $id)->findAll();

        // Mengambil daftar teman dan grup
        $users = $userModel->findAll();
        $groups = $groupsModel->findAll();

        // Mengambil pengguna yang telah berbagi tugas
        $sharedUsers = $sharedModel
            ->join('user', 'user.id_user = shared.id_user')
            ->where('shared.id_tugas', $id)
            ->findAll();

SELECT *
FROM `user`
SELECT *
FROM `tugas`
WHERE `creator_id` = '5'
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `tugas`
WHERE `creator_id` = '5'
---
    public function index()
    {
        $userId = session()->get('id_user');
        $keyword = $this->request->getGet('keyword');
        $perPage = 10;

        $query = $this->tugasModel->where('creator_id', $userId);
        if ($keyword) {
            $query->like('tugas', $keyword);
        }

        $tugas = $query->paginate($perPage);

SELECT `shared`.*, `tugas`.`tugas`, `tugas`.`id` as `tugas_id`
FROM `shared`
JOIN `tugas` ON `tugas`.`id` = `shared`.`id_tugas`
WHERE `shared`.`id_user` = '5'
---
    public function sharedToMe()
    {
        $id_user = session()->get('id_user');
        $sharedTugas = $this->sharedModel
            ->join('tugas', 'tugas.id = shared.id_tugas')
            ->select('shared.*, tugas.tugas, tugas.id as tugas_id')
            ->where('shared.id_user', $id_user)
            ->findAll();

        $userModel = new UserModel();
        $users = [];

        foreach ($sharedTugas as $shared) {
            $user = $userModel->find($shared['shared_by_user_id']);

SELECT *
FROM `tugas`
WHERE `tugas`.`id` = '3'
SELECT *
FROM `groups`
---
     public function share($taskId)
     {
         $task = $this->tugasModel->find($taskId);

         if (!$task) {
             return redirect()->to('/tugas')->with('error', 'Tugas tidak ditemukan.');
         }

         $friendshipModel = new FriendshipModel();
         $groupModel = new GroupModel();
         $friends = $friendshipModel->getFriends(session()->get('id_user')); // Ambil teman berdasarkan id_user
         $groups = $groupModel->findAll(); // Ambil semua grup

INSERT INTO `shared` (`id_tugas`, `shared_by_user_id`, `share_date`, `accept_date`) VALUES ('18', '5', '2025-04-25 10:37:55', NULL)
---
     public function shareTaskToFriend($taskId, $friendId)
     {
         $sharedData = [
             'id_tugas' => $taskId,
             'id_user' => $friendId,
             'shared_by_user_id' => session()->get('id_user'),
             'share_date' => date('Y-m-d H:i:s'),
             'accept_date' => null
         ];

         $this->sharedModel->save($sharedData);