app/Controllers/Tugas.php

    public function detail($id)
    {
        $tugasModel = new TugasModel();
        $attachmentModel = new AttachmentModel();
        $userModel = new UserModel();
        $groupModel = new GroupModel();
        $sharedModel = new SharedModel(); // Menambahkan model SharedModel untuk shared tasks

        // Ambil data tugas
        $tugas = $tugasModel->find($id);

        // Ambil data attachment terkait tugas
        $attachment = $attachmentModel->where('id_tugas', $id)->findAll();

        // Ambil semua user
        $user = $userModel->findAll();

        // Ambil semua grup (atau sesuai kebutuhan kamu bisa menambah filter untuk grup)
        $group = $groupModel->findAll();

        // Ambil daftar shared user
        $sharedUsers = $sharedModel
        ->select('shared.*, user.username')
        ->join('user', 'user.id_user = shared.shared_by') // ini untuk dapat username penerima
        ->where('shared.id_tugas', $id)
        ->findAll();
---
SELECT *
FROM `tugas`
WHERE `tugas`.`id` = '3'
SELECT *
FROM `attachment`
WHERE `id_tugas` = '3'
SELECT *
FROM `user`
SELECT *
FROM `groups`
SELECT `shared`.*, `user`.`username`
FROM `shared`
JOIN `user` ON `user`.`id_user` = `shared`.`shared_by`
WHERE `shared`.`id_tugas` = '3'

public function index()
{
    // Ambil ID user yang sedang login
    $userId = session()->get('id_user'); // Ambil ID user dari session yang sedang login
    $keyword = $this->request->getGet('keyword'); // Jika ada pencarian kata kunci
    $perPage = 10; // Set jumlah data per halaman



    // Query untuk mengambil tugas yang hanya dibuat oleh user yang sedang login
    $query = $this->tugasModel->where('creator_id', $userId);
    if ($keyword) {
        $query->like('tugas', $keyword); // Jika ada kata kunci pencarian, cari tugas yang sesuai
    }

    // Ambil data tugas
    $tugas = $query->paginate($perPage);
---
SELECT *
FROM `tugas`
WHERE `creator_id` = '2'
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `tugas`
WHERE `creator_id` = '2'