app/Controllers/Tugas.php

    public function detail($id)
    {
        $data['title'] = 'Detail Tugas';
        $model = new AttachmentModel();
        $sharedModel = new SharedModel();
        $userModel = new UserModel();
        $groupModel = new \App\Models\GroupModel();

        // Menyesuaikan dengan kolom di database
        $data['attachment'] = $model->select('*')
            ->where('id_tugas', $id)
            ->findAll();

        $data['tugas'] = $this->tugasModel
            ->join('user', 'user.id_user = tugas.creator_id', 'left')  // Menyesuaikan relasi dengan user
            ->where('tugas.id', $id)
            ->first();
---
SELECT *
FROM `tugas`
LEFT JOIN `user` ON `user`.`id_user` = `tugas`.`creator_id`
WHERE `tugas`.`id` = '7'
 LIMIT 1