app/Models/FriendshipModel.php

SELECT `user`.`id_user`, `user`.`username`, `user`.`photo`, `friendship`.`id`, `friendship`.`id_user`, `friendship`.`id_friend`
FROM `friendship`
JOIN `user` ON `user`.`id_user` = IF(friendship.id_user = 5, friendship.id_friend, friendship.id_user)
WHERE `friendship`.`status` = 'accepted'
AND   (
`friendship`.`id_user` = '5'
OR `friendship`.`id_friend` = '5'
 )
---
    public function getFriends($userId)
    {
        return $this->db->table($this->table)
            ->select('user.id_user, user.username, user.photo, friendship.id, friendship.id_user, friendship.id_friend')
            ->join('user', "user.id_user = IF(friendship.id_user = $userId, friendship.id_friend, friendship.id_user)")
            ->where('friendship.status', 'accepted')
            ->groupStart()
                ->where('friendship.id_user', $userId)
                ->orWhere('friendship.id_friend', $userId)
            ->groupEnd()
            ->get()->getResultArray();

SELECT `user`.`id_user`, `user`.`username`, `user`.`photo`, `friendship`.`id`
FROM `friendship`
JOIN `user` ON `user`.`id_user` = `friendship`.`id_user`
WHERE `friendship`.`id_friend` = '2'
AND `friendship`.`status` = 'pending'
---
    public function getFriendRequests($userId)
    {
        return $this->select('user.id_user, user.username, user.photo, friendship.id')
            ->join('user', 'user.id_user = friendship.id_user')
            ->where('friendship.id_friend', $userId)
            ->where('friendship.status', 'pending')
            ->findAll();

SELECT `user`.`id_user`, `user`.`username`, `user`.`photo`, `friendship`.`id`
FROM `friendship`
JOIN `user` ON `user`.`id_user` = `friendship`.`id_friend`
WHERE `friendship`.`id_user` = '2'
AND `friendship`.`status` = 'pending'
---
    public function getSentRequests($userId)
    {
        return $this->select('user.id_user, user.username, user.photo, friendship.id')
            ->join('user', 'user.id_user = friendship.id_friend')
            ->where('friendship.id_user', $userId)
            ->where('friendship.status', 'pending')
            ->findAll();