app/Models/GroupModel.php

    public function getMembers($groupId)
    {
        return $this->db->table('member')
            ->select('member.*, user.username')
            ->join('user', 'user.id_user = member.user_id')
            ->where('member.id_groups', $groupId)
            ->get()
            ->getResultArray();
---
SELECT `member`.*, `user`.`username`
FROM `member`
JOIN `user` ON `user`.`id_user` = `member`.`user_id`
WHERE `member`.`id_groups` = '8'

    public function getGroupsForCurrentUser($userId)
    {
        return $this->db->table('groups')
            ->select('groups.*, user.username')
            ->join('user', 'user.id_user = groups.id_user')
            ->join('member', 'member.id_groups = groups.id_groups')
            ->where('member.user_id', $userId) // <<< Tambah nama tabel biar gak ambigu
            ->get()
            ->getResultArray();
---
SELECT `groups`.*, `user`.`username`
FROM `groups`
JOIN `user` ON `user`.`id_user` = `groups`.`id_user`
JOIN `member` ON `member`.`id_groups` = `groups`.`id_groups`
WHERE `member`.`user_id` = '2'