app/Models/UserModel.php

SELECT *
FROM `user`
WHERE `username` = 'nura'
 LIMIT 1
---
    public function getUserByNama($username)
    {
        return $this->where('username', $username)->first();